In [55]:
import pathlib

# Pandas Fundamentals

This notebook provides an introduction to the `pandas` package. This notebook also borrows heavily from the book *Data Science Handbook*, which was written by Jake VanderPlas and is available at https://jakevdp.github.io/PythonDataScienceHandbook/ (accessed 12/17/2019) and from the pandas documentation.

# What is Pandas?
<a id="pandas"> </a>

The `pandas` package is one of the most popular Python tools for data management and manipulation. `pandas` is built *on top* of `numpy`. Thus, much of the functionality and methods that are available in `numpy` are also available in `pandas`. 

From https://en.wikipedia.org/wiki/Pandas_(software) (accessed 1/7/2018):

>Pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series. It is free software released under the three-clause BSD license. The name is derived from the term "panel data", an econometrics term for multidimensional, structured data sets. Major features of the library are:

> - DataFrame object for data manipulation with integrated indexing.
> - Tools for reading and writing data between in-memory data structures and different file formats.
> - Data alignment and integrated handling of missing data.
> - Reshaping and pivoting of data sets.
> - Label-based slicing, fancy indexing, and subsetting of large data sets.
> - Data structure column insertion and deletion.
> - Group by engine allowing split-apply-combine operations on data sets.
> - Data set merging and joining.
> - Hierarchical axis indexing to work with high-dimensional data in a lower-dimensional data structure.
> - Time series-functionality: Date range generation and frequency conversion, moving window statistics, moving window linear regressions, date shifting and lagging.
> The library is highly optimized for performance, with critical code paths written in Cython or C.

The following code block uses the *import - as* approach to import Pandas. The alias *pd* is a standard convention. We also import NumPy.

In [2]:
%conda list | grep pandas

pandas                    1.3.4                    pypi_0    pypi

Note: you may need to restart the kernel to use updated packages.

In [3]:
import pandas as pd
import numpy as np
from pathlib import Path
import pprint as pp

In [4]:
pd.set_option('display.max_columns', 100)
pd.set_option('display.max_rows', 775)

# Pandas Objects
<a id="Pandas_Objects"> </a>

Pandas objects can be thought of as enhanced NumPy arrays. The two main Pandas objects are:
1. The Pandas `Series`, which is a one-dimensional array of indexed data. Accessing a single column of a DataFrame results in a `Series` object.
2. The Pandas `DataFrame`, which is two-dimensional array of indexed data. A `DataFrame` is a container for multiple series objects. 

The fact that Pandas objects are indexed allows us to lookup and access values by the index. Also, in contrast to NumPy arrays which are for storing numeric data, Pandas objects can store pretty much any Python data type.

## Pandas `Series` Object
To demonstrate the Pandas `Series` object, suppose we have the following 24 data points for sales over a 24 month period stored in a list object named `sales`. Also, we have a list object named `month` that stores the month that the sales occured in using the date format YYYY-MM.

In [5]:
month = ['2015-01-31', '2015-02-28', '2015-03-31', '2015-04-30',
         '2015-05-31', '2015-06-30', '2015-07-31', '2015-08-31',
         '2015-09-30', '2015-10-31', '2015-11-30', '2015-12-31',
         '2016-01-31', '2016-02-29', '2016-03-31', '2016-04-30',
         '2016-05-31', '2016-06-30', '2016-07-31', '2016-08-31',
         '2016-09-30', '2016-10-31', '2016-11-30', '2016-12-31']

sales = [ 872,  873,  990, 1129, 
          969,  964, 1148,  614,
         1068, 1138, 1057,  748,
         1255, 1016, 1058, 1064, 
         1229, 1060, 1144, 1119, 
         1188,  817,  638, 1205]

Similar capabilities are found in NumPy (remember that Pandas is based on NumPy), but in many cases you may find NumPy limitations to be cumbersome. For example, it would be much easier to use month names AS the index rather than be limited to the integer index provided by NumPy.

In [6]:
# What type of object is month? sales?
sales_data = [month, sales]
np_sales = np.array(sales_data)
print(np_sales.shape)

(2, 24)

In [7]:
# Using numpy, if you want sales (row 1) for April, 2015 you have to know which column is April (column 3)
print(np_sales)
print("April 2015 sales: ",np_sales[1,3])

# If you want to format it for currency, you can use the format method
print("April 2015 sales: ${:0,.2f}".format(float(np_sales[1,3])).replace('$-','-$'))

[['2015-01-31' '2015-02-28' '2015-03-31' '2015-04-30' '2015-05-31'
  '2015-06-30' '2015-07-31' '2015-08-31' '2015-09-30' '2015-10-31'
  '2015-11-30' '2015-12-31' '2016-01-31' '2016-02-29' '2016-03-31'
  '2016-04-30' '2016-05-31' '2016-06-30' '2016-07-31' '2016-08-31'
  '2016-09-30' '2016-10-31' '2016-11-30' '2016-12-31']
 ['872' '873' '990' '1129' '969' '964' '1148' '614' '1068' '1138' '1057'
  '748' '1255' '1016' '1058' '1064' '1229' '1060' '1144' '1119' '1188'
  '817' '638' '1205']]
April 2015 sales:  1129
April 2015 sales: $1,129.00

The following code block uses the two lists to create a Pandas `Series` that is stored in a variable named `sales_series`.

In [8]:
sales_series = pd.Series(sales, index = month)

print(f'The sales_series series is\n{sales_series}')

The sales_series series is
2015-01-31     872
2015-02-28     873
2015-03-31     990
2015-04-30    1129
2015-05-31     969
2015-06-30     964
2015-07-31    1148
2015-08-31     614
2015-09-30    1068
2015-10-31    1138
2015-11-30    1057
2015-12-31     748
2016-01-31    1255
2016-02-29    1016
2016-03-31    1058
2016-04-30    1064
2016-05-31    1229
2016-06-30    1060
2016-07-31    1144
2016-08-31    1119
2016-09-30    1188
2016-10-31     817
2016-11-30     638
2016-12-31    1205
dtype: int64

The following code block shows how we can access individual values, or a range of values, in the series.

In [9]:
# Get the sales for April 2015
print("April sales:", sales_series['2015-04-30'])

April sales: 1129

In [10]:
# Get the sales for April 2015 through December 2015 
sales_series['2015-04-30':'2015-12-31']

2015-04-30    1129
2015-05-31     969
2015-06-30     964
2015-07-31    1148
2015-08-31     614
2015-09-30    1068
2015-10-31    1138
2015-11-30    1057
2015-12-31     748
dtype: int64

In [11]:
# Slice the Series object using Integers
# Get the first five rows (Index 0 - 4, not including 5)
sales_series[0:5]

2015-01-31     872
2015-02-28     873
2015-03-31     990
2015-04-30    1129
2015-05-31     969
dtype: int64

Using NumPy-like syntax, we can do computations on `Series` objects. The following code blocks provides examples.

[Back to Table of Contents](#Table_of_Contents)<br>

In [12]:
# Compute the total sales for June 2015 through December 2015 
sales_series['2015-06-30':'2015-12-31'].sum()

6737

In [13]:
# Compute the mean sales for June 2015 through December 2015 
sales_series['2015-06-30':'2015-12-31'].mean()

962.4285714285714

In [14]:
# Compute the maximum sales for June 2015 through December 2015 
sales_series['2015-06-30':'2015-12-31'].max()

1148

## Pandas `DataFrame` Object

We will now look at Pandas `DataFrame` object.

In [15]:
# Use the date_range function to populate a dataframe with a certain number of periods
dates = pd.date_range('20200101', periods=12,freq='M')
print(dates)

DatetimeIndex(['2020-01-31', '2020-02-29', '2020-03-31', '2020-04-30',
               '2020-05-31', '2020-06-30', '2020-07-31', '2020-08-31',
               '2020-09-30', '2020-10-31', '2020-11-30', '2020-12-31'],
              dtype='datetime64[ns]', freq='M')

In [16]:
# Fill the DataFrame with random numbers and assign them to columns (A, B, C, D)
df_random = pd.DataFrame(np.random.randn(12, 4), index=dates, columns=list('ABCD'))
df_random.head(12)

                   A         B         C         D
2020-01-31 -1.668761  0.300652  0.865040 -2.183548
2020-02-29 -0.965809 -1.945070 -1.628700  0.300471
2020-03-31 -1.184018 -0.413048 -0.343422 -2.245617
2020-04-30  0.061326 -0.130091  0.729103  0.873955
2020-05-31 -1.239127 -1.076215 -0.432488  1.013506
2020-06-30  0.040518  0.924805 -1.292534  0.115593
2020-07-31 -0.296164  0.362327 -0.469397  1.842167
2020-08-31  1.377837  0.285436 -0.147112 -2.690366
2020-09-30 -0.448828 -0.705462 -0.538038 -0.569710
2020-10-31  0.840619 -0.510747 -0.168202 -0.829055
2020-11-30  1.252032  0.136838 -2.575602 -0.474615
2020-12-31  1.650120 -1.980415  0.689909  1.288966

In [17]:
# Display a basic description of your DataFrame
df_random.describe()

               A          B          C          D
count  12.000000  12.000000  12.000000  12.000000
mean   -0.048355  -0.395916  -0.442620  -0.296521
std     1.120752   0.909835   1.010251   1.482641
min    -1.668761  -1.980415  -2.575602  -2.690366
25%    -1.020361  -0.798150  -0.726662  -1.167678
50%    -0.127823  -0.271569  -0.387955  -0.179511
75%     0.943472   0.289240   0.062143   0.908843
max     1.650120   0.924805   0.865040   1.842167

In [18]:
# Sort the DataFrame by values
df_random.sort_values(by='B')

                   A         B         C         D
2020-12-31  1.650120 -1.980415  0.689909  1.288966
2020-02-29 -0.965809 -1.945070 -1.628700  0.300471
2020-05-31 -1.239127 -1.076215 -0.432488  1.013506
2020-09-30 -0.448828 -0.705462 -0.538038 -0.569710
2020-10-31  0.840619 -0.510747 -0.168202 -0.829055
2020-03-31 -1.184018 -0.413048 -0.343422 -2.245617
2020-04-30  0.061326 -0.130091  0.729103  0.873955
2020-11-30  1.252032  0.136838 -2.575602 -0.474615
2020-08-31  1.377837  0.285436 -0.147112 -2.690366
2020-01-31 -1.668761  0.300652  0.865040 -2.183548
2020-07-31 -0.296164  0.362327 -0.469397  1.842167
2020-06-30  0.040518  0.924805 -1.292534  0.115593

In [19]:
# To display only the values, use the to_numpy() function
df_random.to_numpy()

array([[-1.6687611 ,  0.30065225,  0.86504011, -2.18354827],
       [-0.96580895, -1.94506993, -1.62869961,  0.30047142],
       [-1.18401757, -0.41304827, -0.34342244, -2.24561691],
       [ 0.06132626, -0.13009057,  0.72910288,  0.87395497],
       [-1.23912697, -1.07621539, -0.43248839,  1.0135064 ],
       [ 0.04051754,  0.92480535, -1.29253365,  0.1155932 ],
       [-0.29616428,  0.36232674, -0.46939738,  1.84216671],
       [ 1.37783702,  0.28543593, -0.14711174, -2.69036589],
       [-0.44882809, -0.705462  , -0.53803759, -0.5697105 ],
       [ 0.84061911, -0.51074749, -0.16820157, -0.82905489],
       [ 1.25203163,  0.13683759, -2.57560239, -0.47461549],
       [ 1.6501195 , -1.98041464,  0.68990878,  1.28896588]])

In [20]:
# The following code provides four lists that provide information on the sales of two products, A and B,
#   in three stores, W1, E1, and E2, over 10 years.

stores_list = ['W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 
               'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 'W1', 
               'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 
               'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 'E1', 
               'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 
               'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2', 'E2']

dates_list = ['12/31/2007', '12/31/2008', '12/31/2009', '12/31/2010', '12/31/2011', '12/31/2012', 
              '12/31/2013', '12/31/2014', '12/31/2015', '12/31/2016', '12/31/2007', '12/31/2008', 
              '12/31/2009', '12/31/2010', '12/31/2011', '12/31/2012', '12/31/2013', '12/31/2014', 
              '12/31/2015', '12/31/2016', '12/31/2007', '12/31/2008', '12/31/2009', '12/31/2010', 
              '12/31/2011', '12/31/2012', '12/31/2013', '12/31/2014', '12/31/2015', '12/31/2016', 
              '12/31/2007', '12/31/2008', '12/31/2009', '12/31/2010', '12/31/2011', '12/31/2012', 
              '12/31/2013', '12/31/2014', '12/31/2015', '12/31/2016', '12/31/2007', '12/31/2008', 
              '12/31/2009', '12/31/2010', '12/31/2011', '12/31/2012', '12/31/2013', '12/31/2014', 
              '12/31/2015', '12/31/2016', '12/31/2007', '12/31/2008', '12/31/2009', '12/31/2010', 
              '12/31/2011', '12/31/2012', '12/31/2013', '12/31/2014', '12/31/2015', '12/31/2016']

product_list = ['A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 
                'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 
                'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 
                'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 
                'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 'A', 
                'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B', 'B']

sales_list = [1957, 1968, 1983, 2001, 1894, 1850, 2045, 1860, 1784, 1856, 
              1891, 1822, 1846, 1903, 1924, 1897, 1890, 1858, 1871, 1880, 
              1858, 1909, 1977, 1717, 1751, 1797, 1804, 1845, 1895, 1713, 
              1904, 1812, 1733, 1868, 1872, 1909, 2034, 1856, 1813, 1806, 
              1862, 1800, 1840, 1882, 1819, 1854, 1716, 1845, 1877, 1879, 
              1696, 1783, 1799, 1852, 1793, 1877, 1687, 1824, 1839, 1889]

The following code block first uses the list to construct a Python dictionary, uses the dictionary to define a Pandas `DataFrame` object named `sales_data`, and uses the `head()` method to print the first 10 rows of the `DataFrame`.

<div class="alert alert-block alert-info">
    <b>The <i>head()</i> function:</b> The <i>head()</i> function is a Pandas object method that prints the first five rows of a Pandas object by default. Specifying an integer argument instructs Pandas to return the specified number of rows from the beginning of the object. Similar to the <i>head()</i> method, the <i>tail()</i> method returns records from the end of a Pandas object.</div>

In [21]:
sales_dictionary = {'Store': stores_list,
                    'Product': product_list,
                    'Sales': sales_list,
                    'Year': dates_list}
# Although a dictionary is useful, it's hard to visualize and less convenient than a DataFrameprint(sales_dictionary)

In [22]:
sales_data = pd.DataFrame.from_dict(sales_dictionary)

sales_data.head(10)

  Store Product  Sales        Year
0    W1       A   1957  12/31/2007
1    W1       A   1968  12/31/2008
2    W1       A   1983  12/31/2009
3    W1       A   2001  12/31/2010
4    W1       A   1894  12/31/2011
5    W1       A   1850  12/31/2012
6    W1       A   2045  12/31/2013
7    W1       A   1860  12/31/2014
8    W1       A   1784  12/31/2015
9    W1       A   1856  12/31/2016

A key thing to note is that the format of the `DataFrame` object is very similar to what you would see when working with Microsoft Excel worksheets. 

There are many other ways to create Pandas objects from scratch. However, for the sake of space, we will stop here. See https://jakevdp.github.io/PythonDataScienceHandbook/03.01-introducing-pandas-objects.html or use Google to find other examples.

# Importing Data

One of the most useful applications of Pandas is that it provides users with an easy way to import data from other sources. The following table was copied from https://pandas.pydata.org/pandas-docs/stable/io.html. Note that the hyperlinks will take you to sites descibing the different file formats or methods.

<table border="1" class="colwidths-given docutils">
<colgroup>
<col width="12%" />
<col width="40%" />
<col width="24%" />
<col width="24%" />
</colgroup>
<thead valign="bottom">
<tr class="row-odd"><th class="head">Format Type</th>
<th class="head">Data Description</th>
<th class="head">Reader</th>
<th class="head">Writer</th>
</tr>
</thead>
<tbody valign="top">
<tr class="row-even"><td>text</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Comma-separated_values">CSV</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-read-csv-table"><span class="std std-ref">read_csv</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-store-in-csv"><span class="std std-ref">to_csv</span></a></td>
</tr>
<tr class="row-odd"><td>text</td>
<td><a class="reference external" href="http://www.json.org/">JSON</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-json-reader"><span class="std std-ref">read_json</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-json-writer"><span class="std std-ref">to_json</span></a></td>
</tr>
<tr class="row-even"><td>text</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/HTML">HTML</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-read-html"><span class="std std-ref">read_html</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-html"><span class="std std-ref">to_html</span></a></td>
</tr>
<tr class="row-odd"><td>text</td>
<td>Local clipboard</td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-clipboard"><span class="std std-ref">read_clipboard</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-clipboard"><span class="std std-ref">to_clipboard</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Microsoft_Excel">MS Excel</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-excel-reader"><span class="std std-ref">read_excel</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-excel-writer"><span class="std std-ref">to_excel</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://support.hdfgroup.org/HDF5/whatishdf5.html">HDF5 Format</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-hdf5"><span class="std std-ref">read_hdf</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-hdf5"><span class="std std-ref">to_hdf</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://github.com/wesm/feather">Feather Format</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-feather"><span class="std std-ref">read_feather</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-feather"><span class="std std-ref">to_feather</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://parquet.apache.org/">Parquet Format</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-parquet"><span class="std std-ref">read_parquet</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-parquet"><span class="std std-ref">to_parquet</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="http://msgpack.org/index.html">Msgpack</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-msgpack"><span class="std std-ref">read_msgpack</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-msgpack"><span class="std std-ref">to_msgpack</span></a></td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/Stata">Stata</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-stata-reader"><span class="std std-ref">read_stata</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-stata-writer"><span class="std std-ref">to_stata</span></a></td>
</tr>
<tr class="row-even"><td>binary</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/SAS_(software)">SAS</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-sas-reader"><span class="std std-ref">read_sas</span></a></td>
<td>&#160;</td>
</tr>
<tr class="row-odd"><td>binary</td>
<td><a class="reference external" href="https://docs.python.org/3/library/pickle.html">Python Pickle Format</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-pickle"><span class="std std-ref">read_pickle</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-pickle"><span class="std std-ref">to_pickle</span></a></td>
</tr>
<tr class="row-even"><td>SQL</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/SQL">SQL</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-sql"><span class="std std-ref">read_sql</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-sql"><span class="std std-ref">to_sql</span></a></td>
</tr>
<tr class="row-odd"><td>SQL</td>
<td><a class="reference external" href="https://en.wikipedia.org/wiki/BigQuery">Google Big Query</a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-bigquery"><span class="std std-ref">read_gbq</span></a></td>
<td><a class="reference internal" href="https://pandas.pydata.org/pandas-docs/stable/io.html#io-bigquery"><span class="std std-ref">to_gbq</span></a></td>
</tr>
</tbody>
</table>

The following code block shows how the `read_csv` method that is available in Pandas can be used to read a file from the Internet that uses semi-colon delimiters, store it in an object named `my_data`, and use the `head()` method to print the first fives rows of the `DataFrame` object.

In [23]:
my_data = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/00409/Daily_Demand_Forecasting_Orders.csv',
           delimiter = ';')

my_data.head()

,"Week of the month (first week, second, third, fourth or fifth week",Day of the week (Monday to Friday),Non-urgent order,Urgent order,Order type A,Order type B,Order type C,Fiscal sector orders,Orders from the traffic controller sector,Banking orders (1),Banking orders (2),Banking orders (3),Target (Total orders)
0,1,4,316.307,223.270,61.543,175.586,302.448,0.000,65556,44914,188411,14793,539.577
1,1,5,128.633,96.042,38.058,56.037,130.580,0.000,40419,21399,89461,7679,224.675
2,1,6,43.651,84.375,21.826,25.125,82.461,1.386,11992,3452,21305,14947,129.412
3,2,2,171.297,127.667,41.542,113.294,162.284,18.156,49971,33703,69054,18423,317.120
4,2,3,90.532,113.526,37.679,56.618,116.220,6.459,48534,19646,16411,20257,210.517

In [24]:
# After importing the data, it may be helpful to view the column data types
#   Use the dtypes attribute
my_data.dtypes

Week of the month (first week, second, third, fourth or fifth week      int64
Day of the week (Monday to Friday)                                      int64
Non-urgent order                                                      float64
Urgent order                                                          float64
Order type A                                                          float64
Order type B                                                          float64
Order type C                                                          float64
Fiscal sector orders                                                  float64
Orders from the traffic controller sector                               int64
Banking orders (1)                                                      int64
Banking orders (2)                                                      int64
Banking orders (3)                                                      int64
Target (Total orders)                                                 float64
dtype: object

Pandas can also read directly from a compressed file. Here is the code for you to directly read a compressed file to a dataframe.
```Python
df = pd.read_csv('Sales_Data.csv.gz', compression = 'gzip')
```

## Importing data from the clipboard

Another method of obtaining data is to read it in from the clipboard. The clipboard is a location in memory where recently copied data can be accessed. It is where data are stored after cutting or copying.

In [25]:
# Copy some table data 
import pandas as pd
df = pd.read_clipboard(header=None)
df

,0,1,2,3
0,/media/gjbott/internal_data/Dropbox/research/g...,Liquor,Part,2/data/ILS_2019_on.csv.gz

# Indexing and Selecting Data

Although we have already seen some ways to access data in Pandas objects, this section will look at such methods in more detail.

## Indexing and Selecting Data in Pandas `Series` Objects

Recall the `sales_series` object that we created earlier.

In [26]:
# To increase the number of columns Jupyter Lab will display at a time use set_option
pd.set_option('display.max_columns', 100)
pd.set_option('display.max_rows', 100)

In [27]:
sales_series

2015-01-31     872
2015-02-28     873
2015-03-31     990
2015-04-30    1129
2015-05-31     969
2015-06-30     964
2015-07-31    1148
2015-08-31     614
2015-09-30    1068
2015-10-31    1138
2015-11-30    1057
2015-12-31     748
2016-01-31    1255
2016-02-29    1016
2016-03-31    1058
2016-04-30    1064
2016-05-31    1229
2016-06-30    1060
2016-07-31    1144
2016-08-31    1119
2016-09-30    1188
2016-10-31     817
2016-11-30     638
2016-12-31    1205
dtype: int64

It's interesting to note that the Pandas `Series` object acts like both a one-dimensional NumPy array and a standard Python dictionary. For example, to get index values for a `Series` object, you can use the `keys()` method as shown below.

In [28]:
sales_series.keys()

Index(['2015-01-31', '2015-02-28', '2015-03-31', '2015-04-30', '2015-05-31',
       '2015-06-30', '2015-07-31', '2015-08-31', '2015-09-30', '2015-10-31',
       '2015-11-30', '2015-12-31', '2016-01-31', '2016-02-29', '2016-03-31',
       '2016-04-30', '2016-05-31', '2016-06-30', '2016-07-31', '2016-08-31',
       '2016-09-30', '2016-10-31', '2016-11-30', '2016-12-31'],
      dtype='object')

We can also display its values.

In [29]:
sales_series.values

array([ 872,  873,  990, 1129,  969,  964, 1148,  614, 1068, 1138, 1057,
        748, 1255, 1016, 1058, 1064, 1229, 1060, 1144, 1119, 1188,  817,
        638, 1205])

Also, as shown earlier, we can use NumPy-like slicing as is demonstrated in the following code block.

In [30]:
# Get the sales for June 2015 through December 2015 
sales_series['2015-06-30':'2015-12-31']

2015-06-30     964
2015-07-31    1148
2015-08-31     614
2015-09-30    1068
2015-10-31    1138
2015-11-30    1057
2015-12-31     748
dtype: int64

Finally, we can use the boolean array capabilities of NumPy to get subsets of the `Series` object that satisfy a specified condition. As an example, the following code block identifies the months with sales greater than or equal to 1,000.

In [31]:
# Which months had sales greater than $1,000? Show only the months, not the values by using keys().
big_sales = sales_series[(sales_series > 1000)].keys()
print("Number of months > $1,000: ", len(big_sales))
print(big_sales)

Number of months > $1,000:  15
Index(['2015-04-30', '2015-07-31', '2015-09-30', '2015-10-31', '2015-11-30',
       '2016-01-31', '2016-02-29', '2016-03-31', '2016-04-30', '2016-05-31',
       '2016-06-30', '2016-07-31', '2016-08-31', '2016-09-30', '2016-12-31'],
      dtype='object')

## Indexing and Selecting Data in Pandas `DataFrame` Objects

We will now look at accessing data stored in a Pandas `DataFrame` object. Just as a reminder, the following code block prints the first five rows of the `sales_data` object that we created earlier.

In [32]:
sales_data.head()

  Store Product  Sales        Year
0    W1       A   1957  12/31/2007
1    W1       A   1968  12/31/2008
2    W1       A   1983  12/31/2009
3    W1       A   2001  12/31/2010
4    W1       A   1894  12/31/2011

As shown in the following code block, we can select an entire column of the `DataFrame` object, resulting in a `Series`, by providing the column name in brackets.

In [33]:
sales_data['Sales'][:3] #limit to the first 3 rows

0    1957
1    1968
2    1983
Name: Sales, dtype: int64

Moreover, we can return multiple columns by providing the names of the desired columns as a list. Since we are returning multiple columns, the resulting object is a `DataFrame`.

In [34]:
sales_data[['Product','Sales']][:5]

  Product  Sales
0       A   1957
1       A   1968
2       A   1983
3       A   2001
4       A   1894

Similar to NumPy, we can perform calculations using entire columns.

In [35]:
(sales_data['Sales']/365).apply(lambda x: "${:.2f}".format(x))[:5]

0    $5.36
1    $5.39
2    $5.43
3    $5.48
4    $5.19
Name: Sales, dtype: object

We can extract a subset of the available records by providing a boolean expression in brackets.

In [36]:
sales_data[sales_data['Product']=='B']

   Store Product  Sales        Year
10    W1       B   1891  12/31/2007
11    W1       B   1822  12/31/2008
12    W1       B   1846  12/31/2009
13    W1       B   1903  12/31/2010
14    W1       B   1924  12/31/2011
15    W1       B   1897  12/31/2012
16    W1       B   1890  12/31/2013
17    W1       B   1858  12/31/2014
18    W1       B   1871  12/31/2015
19    W1       B   1880  12/31/2016
30    E1       B   1904  12/31/2007
31    E1       B   1812  12/31/2008
32    E1       B   1733  12/31/2009
33    E1       B   1868  12/31/2010
34    E1       B   1872  12/31/2011
35    E1       B   1909  12/31/2012
36    E1       B   2034  12/31/2013
37    E1       B   1856  12/31/2014
38    E1       B   1813  12/31/2015
39    E1       B   1806  12/31/2016
50    E2       B   1696  12/31/2007
51    E2       B   1783  12/31/2008
52    E2       B   1799  12/31/2009
53    E2       B   1852  12/31/2010
54    E2       B   1793  12/31/2011
55    E2       B   1877  12/31/2012
56    E2       B   1687  12/31/2013
57    E2       B   1824  12/31/2014
58    E2       B   1839  12/31/2015
59    E2       B   1889  12/31/2016

In [37]:
# Applying a filter to the DataFrame does not change the underlying dataset
sales_data.head(15)

   Store Product  Sales        Year
0     W1       A   1957  12/31/2007
1     W1       A   1968  12/31/2008
2     W1       A   1983  12/31/2009
3     W1       A   2001  12/31/2010
4     W1       A   1894  12/31/2011
5     W1       A   1850  12/31/2012
6     W1       A   2045  12/31/2013
7     W1       A   1860  12/31/2014
8     W1       A   1784  12/31/2015
9     W1       A   1856  12/31/2016
10    W1       B   1891  12/31/2007
11    W1       B   1822  12/31/2008
12    W1       B   1846  12/31/2009
13    W1       B   1903  12/31/2010
14    W1       B   1924  12/31/2011

Being built on top of NumPy, we can create more complicated boolean expressions to select subsets of records. The following code block shows how we can define and use multi-condition boolean expression to select records where the store is *E1* and the sales is greater than 1,850.

In [38]:
my_condition = (sales_data['Store'] == 'E1') & (sales_data['Sales'] > 1850)

In [39]:
sales_data[my_condition]

   Store Product  Sales        Year
20    E1       A   1858  12/31/2007
21    E1       A   1909  12/31/2008
22    E1       A   1977  12/31/2009
28    E1       A   1895  12/31/2015
30    E1       B   1904  12/31/2007
33    E1       B   1868  12/31/2010
34    E1       B   1872  12/31/2011
35    E1       B   1909  12/31/2012
36    E1       B   2034  12/31/2013
37    E1       B   1856  12/31/2014

## Using iloc (integer location) to access data
Use `iloc` to access data within a DataFrame by passing an integer or list of integers.

For example, if you want the first two rows of data pass an inner list to your DataFrame.

```Python
df.iloc[[<row selection>], [<column selection>]]
```

In [40]:
ms_store_file = Path.cwd() / 'files' / 'Microsoft_Store.csv'

In [41]:
# Load Microsoft Store rating data
import pandas as pd
try:
    df_ms = pd.read_csv('files/Microsoft_Store.csv')
except Exception as e:
    print(e)

In [42]:
# Review the data
df_ms.head()

,Name,Rating,No of people Rated,Category,Date,Price
0,Dynamic Reader,3.5,268,Books,07-01-2014,Free
1,"Chemistry, Organic Chemistry and Biochemistry-...",3.0,627,Books,08-01-2014,Free
2,BookViewer,3.5,593,Books,29-02-2016,free
3,Brick Instructions,3.5,684,Books,30-01-2018,free
4,Introduction to Python Programming by GoLearni...,2.0,634,Books,30-01-2018,Free

In [43]:
# Use integer location (iloc) to display the first and third rows--row 0 and row 2)
df_ms.iloc[[2,3],0:2]

                 Name  Rating
2          BookViewer     3.5
3  Brick Instructions     3.5

In [44]:
# Display row index 2 and 3 and only the first (index 0) and third (index 2) columns
df_ms.iloc[[2,3],[0,2]]

                 Name  No of people Rated
2          BookViewer                 593
3  Brick Instructions                 684

## Using loc to access and change data
Using the `.loc` *indexer* method for Pandas, we can use this boolean expression to return a subset of the available columns.

In [45]:
df_ms.columns

Index(['Name', 'Rating', 'No of people Rated', 'Category', 'Date', 'Price'], dtype='object')

In [46]:
my_condition = (df_ms['No of people Rated'] > 300) & (df_ms['Rating'] == 5)

## The following loc expression uses the boolean expression to filter the rows,
## and then uses the list of column names to define the subset of columns to return
df_ms.loc[my_condition,['Name','No of people Rated','Rating']]

,Name,No of people Rated,Rating
57,Easy Typing Practice in 1 Day,534,5.0
73,Learn Xcode 101 by WAGmob,864,5.0
85,A Romance Novel by Jane Austen,908,5.0
109,Learn Larivaar,841,5.0
115,Learn Agricultural Engineering by GoLearningBus,735,5.0
...,...,...,...
5294,Modbus Monitor,776,5.0
5297,"XML Hub - XML to JSON Converter, XML Formatter...",796,5.0
5303,PairBLENow,436,5.0
5305,Littledot,987,5.0
5309,TPipingHMI,546,5.0

Please see https://jakevdp.github.io/PythonDataScienceHandbook/03.02-data-indexing-and-selection.html for more discussion on indexing and selecting with Pandas objects.

# Handling Missing Data

In this section, we will look at a few capabilities built into Pandas for the purpose of handling missing data. For this demonstration, we will use a subset of the data contained in the `sales_data` object. The following code block creates and prints the data subset.

In [48]:
my_subset.columns

Index(['Name', 'Rating', 'No of people Rated', 'Category', 'Date', 'Price'], dtype='object')

## Fill NaN with a number

In [ ]:
my_subset['Rating'].unique()

In [ ]:
my_subset['Price'].fillna(0)

## Forward Fill Values
In some situations, it may be reasonable to *forward fill* values whenever missing values are encountered. Essentially, the *forward filling* method use a preceding value in the DataFrame, and can be accomplished using the `fillna` Pandas method as shown in the following code block. **Note that this function can take an *axis* argument, specifying the direction of filling. In this case, we want to fill across the rows, or axis 0.**

In [ ]:
def make_subset():
    my_subset = sales_data[(sales_data['Product']=='A') & (sales_data['Store']=='W1')].copy()
    my_subset.iloc[[2,3,6,7],[2]] = None
    return my_subset

In [ ]:
my_subset = make_subset()

In [ ]:
my_subset = make_subset()

In [ ]:
my_subset

In [ ]:
my_subset.fillna(axis = 0, method = 'ffill')

## Back Fill Values
In contrast, it is also possible to *back fill* values, using values that follow in the DataFrame. This approach can be accomplished as shown in the following code block.

In [ ]:
my_subset = make_subset()

In [ ]:
my_subset.fillna(axis = 0, method = 'bfill')

## Interpolate Values
Instead of forward or back filling missing values, we may also use the `interpolate` method to take the average of preceding and following values. This approach is demonstrated below.

In [ ]:
my_subset = make_subset()

In [ ]:
my_subset.interpolate(axis = 0)

## Drop Values 
The final approach to handling missing values that we will cover is to drop the values. This can be done using the `dropna` method shown in the following code block.

In [ ]:
my_subset = make_subset()

In [ ]:
my_subset

In [ ]:
my_subset.dropna(axis = 0)

We can also drop missing values by specifying a condition that the records with missing values will fail. For example, the following code block uses the condition `my_subset['Sales']>0` to effectively drop the records with missing sales values (i.e., 2011 and 2014 sales). 

[Back to Table of Contents](#Table_of_Contents)<br>

In [ ]:
my_subset[my_subset['Sales']>0]

## Masking Fails if NaN present

In [68]:
# Error: Name contains NA/NaN values
python_books = df_ms.loc[df_ms['Name'].str.contains("Python", case=False)]

ValueError: Cannot mask with non-boolean array containing NA / NaN values

In [69]:
# Ignore NA values by setting na = False
python_books = df_ms.loc[df_ms['Name'].str.contains("Python", case=False, na=False)]
python_books

,Name,Rating,No of people Rated,Category,Date,Price
4,Introduction to Python Programming by GoLearni...,2.0,634,Books,30-01-2018,Free
358,Learn Django and Python by GoLearningBus,3.0,711,Books,12-06-2014,Free
1278,Python 3.8,3.5,697,Developer Tools,18-12-2018,Free
1283,Python 3.7,3.5,804,Developer Tools,12-12-2018,Free
1295,Python 3.9 (Beta),5.0,100,Developer Tools,19-11-2019,Free
1404,InstantPython,5.0,414,Developer Tools,20-04-2020,Free
5290,Python Playground,3.0,457,Developer Tools,23-08-2018,₹ 54.00

# Changing Data Types
Call pandas.DataFrame.astype(dtype) with dtype as a dictionary containing mappings of column names to values to change the type of each column in pandas.DataFrame.

In [51]:
# Get date and day name of BookViewer entry
# ERROR: This fails because .day_name is not a method for a string. 
try:
    print(df_ms.loc[2, 'Date'])
    print(df_ms.loc[2, 'Date'].day_name())
except Exception as e:
    print(e)

29-02-2016
'str' object has no attribute 'day_name'

In [52]:
df_ms['Price'].unique

<bound method Series.unique of 0           Free
1           Free
2           free
3           free
4           Free
          ...
5317    ₹ 269.00
5318     ₹ 64.00
5319    ₹ 269.00
5320    ₹ 219.00
5321         NaN
Name: Price, Length: 5322, dtype: object>

## Converting columns to other data types
If the date/time column is in a standard format the Pandas understand, it will convert it automatically. If not, you must provide the string format for Pandas to properly interpret and convert the data. See (https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#providing-a-format-argument) for details.

### Convert String to datetime object

In [ ]:
# Convert the date string to a datetime object.

# With formatting string (unnecessary for this example because date format is recognized by Pandas)
df_ms['Date'] = pd.to_datetime(df_ms['Date'], format='%d-%m-%Y')

# No formatting string provides, so Pandas will make its best attempt at conversion.
#df_ms['Date'] = pd.to_datetime(df_ms['Date'])

In [ ]:
df_ms.dtypes

In [ ]:
# Get date of Bookviewer entry
# This succeeds because 'Date' was converted from a string to a datetime object 
try:
    print(df_ms.loc[2, 'Date'])
    print(df_ms.loc[2, 'Date'].day_name())
except Exception as e:
    print(e)

In [ ]:
# You can also perform date/time conversions when you load a dataset
# Use the parse_dates parameter and pass the datetime columns of your dataset

df_ms = pd.read_csv(ms_store_file, parse_dates=['Date'])
print(df_ms.loc[2, 'Date'].day_name())

### Convert string or object to float

Syntax: 
```Python
pandas.to_numeric(arg, errors=’raise’, downcast=None)
```
Parameters:

arg : list, tuple, 1-d array, or Series

errors : {‘ignore’, ‘raise’, ‘coerce’}, default ‘raise’
* If ‘raise’, then invalid parsing will raise an exception
* If ‘coerce’, then invalid parsing will be set as NaN
* If ‘ignore’, then invalid parsing will return the input


downcast : [default None] If not None, and if the data has been successfully cast to a numerical dtype downcast that resulting data to the smallest numerical dtype possible according to the following rules:
* ‘integer’ or ‘signed’: smallest signed int dtype (min.: np.int8)
* ‘unsigned’: smallest unsigned int dtype (min.: np.uint8)
* ‘float’: smallest float dtype (min.: np.float32)

Returns: numeric if parsing succeeded. Note that return type depends on input. Series if Series, otherwise ndarray.

In [56]:
# Check data types before conversion
df_ms.dtypes

Name                          object
Rating                       float64
No of people Rated             int64
Category                      object
Date                  datetime64[ns]
Price                         object
dtype: object

In [57]:
# Check the first few rows
df_ms.head(15)

,Name,Rating,No of people Rated,Category,Date,Price
0,Dynamic Reader,3.5,268,Books,2014-01-07,Free
1,"Chemistry, Organic Chemistry and Biochemistry-...",3.0,627,Books,2014-01-08,Free
2,BookViewer,3.5,593,Books,2016-02-29,free
3,Brick Instructions,3.5,684,Books,2018-01-30,free
4,Introduction to Python Programming by GoLearni...,2.0,634,Books,2018-01-30,Free
5,Gurbani Reader,4.5,399,Books,2017-01-18,Free
6,NFO Viewer,4.5,566,Books,2012-11-13,Free
7,Text to Speech TTS,3.0,175,Books,2013-10-17,Free
8,ACK Comics,4.0,460,Books,2012-12-20,Free
9,Learn Biology and Human Body Anatomy by GoLear...,3.5,363,Books,2013-11-25,Free
10,Coding Made Easy - SQL,4.0,774,Books,2018-01-30,Free
11,Baani : Nitnem,4.0,533,Books,2014-08-29,Free
12,iMac® 101,4.0,707,Books,2014-03-28,Free
13,Complete C Programs,4.0,687,Books,2012-12-07,Free
14,Historical Places in India,4.5,825,Books,2018-02-18,Free

In [58]:
# Check the last few rows
df_ms.tail(15)

,Name,Rating,No of people Rated,Category,Date,Price
5307,IpTray,1.5,848,Developer Tools,2019-03-04,₹ 209.00
5308,Database Designer SDK,3.5,502,Developer Tools,2018-01-16,₹ 699.00
5309,TPipingHMI,5.0,546,Developer Tools,2017-10-18,₹ 269.00
5310,EditPlus,4.0,778,Developer Tools,2016-09-27,"₹ 1,899.00"
5311,0x Hex Viewer,4.0,211,Developer Tools,2016-02-20,₹ 54.00
5312,Assets Resizer for Windows Store,3.5,566,Developer Tools,2015-09-22,₹ 54.00
5313,WWWmaster,3.5,150,Developer Tools,2018-01-12,₹ 489.00
5314,HexToolkit,3.5,214,Developer Tools,2017-09-25,₹ 54.00
5315,Visual Studio Image Scaler,1.0,756,Developer Tools,2017-05-15,₹ 54.00
5316,Get Color,3.0,785,Developer Tools,2019-08-08,₹ 54.50
5317,JS King,1.0,720,Developer Tools,2018-07-19,₹ 269.00
5318,MQTTSniffer,2.5,500,Developer Tools,2017-04-10,₹ 64.00
5319,"Dev Utils - JSON, CSV and XML",4.0,862,Developer Tools,2019-11-18,₹ 269.00
5320,Simply Text,4.0,386,Developer Tools,2014-01-23,₹ 219.00
5321,NaN,NaN,948,NaN,NaT,NaN

In [59]:
# Check items that aren't free
df_ms[df_ms['Price']!='Free']

,Name,Rating,No of people Rated,Category,Date,Price
2,BookViewer,3.5,593,Books,2016-02-29,free
3,Brick Instructions,3.5,684,Books,2018-01-30,free
5163,Bluestacks app player: guide,1.5,760,Books,2019-12-16,₹ 144.00
5164,Adobe Acrobat Reader DC PC Guide,2.0,163,Books,2020-06-28,₹ 144.00
5165,Play Books Online (Client For Google Books),2.5,292,Books,2016-01-14,₹ 54.00
...,...,...,...,...,...,...
5317,JS King,1.0,720,Developer Tools,2018-07-19,₹ 269.00
5318,MQTTSniffer,2.5,500,Developer Tools,2017-04-10,₹ 64.00
5319,"Dev Utils - JSON, CSV and XML",4.0,862,Developer Tools,2019-11-18,₹ 269.00
5320,Simply Text,4.0,386,Developer Tools,2014-01-23,₹ 219.00
5321,NaN,NaN,948,NaN,NaT,NaN

In [60]:
# Does a particular column have any NaN values?
df_ms['Price'].isnull().values.any()

True

In [61]:
# Does the DataFrame have any NaN values?
df_ms.isnull().values.any()

True

In [67]:
# How many NaN values are in the DataFrame (by column)?
df_ms.isnull().sum()

Name                  0
Rating                0
No of people Rated    0
Category              0
Date                  0
Price                 0
dtype: int64

In [63]:
# How many NaN values are in the DataFrame (entire DataFrame)?
df_ms.isnull().sum().sum()

5

In [64]:
# Return the NaN rows
df_ms[df_ms['Price'].isnull()]

     Name  Rating  No of people Rated Category Date Price
5321  NaN     NaN                 948      NaN  NaT   NaN

In [65]:
# Delete (drop) the row using its index number
df_ms.drop(5321, inplace=True)

In [85]:
# Get all unique prices 
#   (not feasible to display all unique prices for a large data set)
df_ms['Price'].unique()

array([nan, '144.00', '54.00', '99.00', '219.00', '269.00', '134.00',
       '164.00', '109.00', '1,624.00', '1,099.00', '1,349.00', '59.00',
       '154.00', '119.00', '94.00', '69.00', '139.00', '189.00', '549.00',
       '79.00', '2,599.00', '299.00', '574.00', '329.40', '1,521.80',
       '324.00', '824.00', '5,449.00', '89.50', '114.00', '194.00',
       '319.00', '624.00', '2,149.00', '1,149.00', '434.00', '279.00',
       '209.00', '699.00', '1,899.00', '489.00', '54.50', '64.00'],
      dtype=object)

In [77]:
# Carefully consider (and test) the error parameter. 
#   What if we used 'ignore'? Valid? Ideal output? 'coerce'?
test_df['Price'] = pd.to_numeric(df_ms['Price'], downcast='float', errors='coerce')

In [86]:
test_df['Price'].unique()

array([nan], dtype=float32)

In [91]:
# We'll assume that null prices are Free apps and replace NaN with Zero
df_ms['Price'] = df_ms['Price'].replace([np.nan], 0)

In [80]:
# Since we want the column to be a float, let's replace all the 'Free' prices with Zero
df_ms['Price'] = df_ms['Price'].replace('[F|f]ree', 0, regex=True)

In [84]:
# Conversion failed earlier because of the symbol. Let's remove it.
df_ms['Price'] = df_ms['Price'].str.replace('₹ ', '')

In [92]:
# Get all unique prices
df_ms['Price'].unique()

array([  0. , 144. ,  54. ,  99. , 219. , 269. , 134. , 164. , 109. ,
        59. , 154. , 119. ,  94. ,  69. , 139. , 189. , 549. ,  79. ,
       299. , 574. , 329.4, 324. , 824. ,  89.5, 114. , 194. , 319. ,
       624. , 434. , 279. , 209. , 699. , 489. ,  54.5,  64. ],
      dtype=float32)

In [89]:
# Carefully consider (and test) the error parameter. 
#   What if we used 'ignore'? Valid? Ideal output? 'coerce'?
df_ms['Price'] = pd.to_numeric(df_ms['Price'], downcast='float', errors='coerce')

In [93]:
# Confirm Price is a float. What type of float is it? Why?
df_ms.dtypes

Name                          object
Rating                       float64
No of people Rated             int64
Category                      object
Date                  datetime64[ns]
Price                        float32
dtype: object

# Adding, Renaming and dropping columns
Let's rename a column to be shorter.

In [94]:
# Provide the current name and new name of a column. Write the change to the DataFrame using inplace = True
df_ms.rename(columns = {'No of people Rated':'# of Ratings'}, inplace = True)

In [95]:
df_ms.columns

Index(['Name', 'Rating', '# of Ratings', 'Category', 'Date', 'Price'], dtype='object')

We can also add a column using values from an existing column. In this example, we're adding a Local tax column to show the amount of tax that would be applied to the sale.

In [96]:
df_ms['Local tax'] = df_ms['Price'] *.09

df_ms[['Name','Price','Local tax']]

                                                   Name  Price  Local tax
0                                        Dynamic Reader    0.0   0.000000
1     Chemistry, Organic Chemistry and Biochemistry-...    0.0   0.000000
2                                            BookViewer    0.0   0.000000
3                                    Brick Instructions    0.0   0.000000
4     Introduction to Python Programming by GoLearni...    0.0   0.000000
...                                                 ...    ...        ...
5316                                          Get Color   54.5   4.905000
5317                                            JS King  269.0  24.210001
5318                                        MQTTSniffer   64.0   5.760000
5319                      Dev Utils - JSON, CSV and XML  269.0  24.210001
5320                                        Simply Text  219.0  19.710001

[5321 rows x 3 columns]

Sales tax should be handled by the point-of-sale, so we'll delete this column. For the deletion to persist either save the result into a new dataframe or use inplace=True.

In [97]:
df_ms.drop(columns=['Local tax'],inplace=True)

df_ms.columns #Local tax is no longer listed

Index(['Name', 'Rating', '# of Ratings', 'Category', 'Date', 'Price'], dtype='object')

## Replacing Data
Often when using a data set you will need to make values consistent. For example, in the ms_df DataFrame, one of the categoris is Deveoper Tools. In all other data sets within your organization a different term is used for that category. Instead of "Developer Tools", your organization has standardized on "DevTools". Consequently, you'll want to change every occurrence of "Developer Tools" to "DevTools". This is easily accomplished in Pandas.

In [77]:
df_ms["Category"].unique()

array(['Books', 'Business', 'Developer Tools', 'Social',
       'Food and Dining', 'Government and Politics', 'Health and Fitness',
       'Kids and Family', 'Lifestyle', 'Multimedia Design', 'Music',
       'Navigation and Maps', 'News and Weather', nan], dtype=object)

In [ ]:
df_ms["Category"].replace("Developer Tools","DevTools", inplace=True)

In [ ]:
# Examine the Python books (which are in the modified category)
df_ms.loc[df_ms['Name'].str.contains("Python", case=False, na=False)]

# Working with Dates and times in Pandas
Pandas offers power and convenient featurs to handle dates and times. 

Properly read 
Filter by date time
Group date time
Plot using timeseries data

In [64]:
ms_store_file = pathlib.Path('files/Microsoft_Store.csv')

In [65]:
# Load Microsoft Store rating data
import pandas as pd
try:
    df_ms = pd.read_csv(ms_store_file)
except Exception as e:
    print(e)

In [70]:
# View first 5 rows
df_ms.head()

,Name,Rating,No of people Rated,Category,Date,Price
0,Dynamic Reader,3.5,268,Books,07-01-2014,Free
1,"Chemistry, Organic Chemistry and Biochemistry-...",3.0,627,Books,08-01-2014,Free
2,BookViewer,3.5,593,Books,29-02-2016,free
3,Brick Instructions,3.5,684,Books,30-01-2018,free
4,Introduction to Python Programming by GoLearni...,2.0,634,Books,30-01-2018,Free

Viewing the fist few records shows that the date seems to be consistently formatted.

> What is the date format? Speculate as to why the date is using that particular format.

Next, we need to check whether Pandas has associated the proper file type with the Date field.

In [72]:
df_ms.dtypes

Name                   object
Rating                float64
No of people Rated      int64
Category               object
Date                   object
Price                  object
dtype: object

> What type os the Date field? Is it the proper type?

If the data set was large, spanning many columns, you may want to limit the display to only the columns in which you are interested.

You can also check a random set of rows beyond the top (head) or bottom (tail) rows by using loc.

In [75]:
df_ms.loc[20:40, ['Date', 'Name', 'Price']]

          Date                                               Name Price
20  02-05-2019                  GRE Vocabulary Lists - Collection  Free
21  05-02-2016                                 Quran Word By Word  Free
22  22-10-2015                                     Flip CB Reader  Free
23  29-01-2018                                            WikiMed  Free
24  14-08-2013                              BIG Book Of Shortcuts  Free
25  02-11-2014                                           My Shelf  Free
26  23-02-2013                                           MyeBooks  Free
27  28-09-2012                                       Just Origami  Free
28  21-10-2017                     English-Bangla Dictionary[UWP]  Free
29  08-05-2017                                       Comics World  Free
30  01-09-2015                      Chambers English Dictionaries  Free
31  08-05-2015  NCERT Grade 12 Physics via Videos by GoLearnin...  Free
32  11-04-2015                                    Al-Quran Tajwid  Free
33  31-10-2016                                   Crafting Planner  Free
34  26-01-2016                                      Jalees Reader  Free
35  05-01-2017                                              Qaida  Free
36  30-01-2018                  Common Core Math by GoLearningBus  Free
37  24-01-2013                                        திருக்குறள்  Free
38  24-01-2014  Keyboard Shortcuts for MS Office 2013-simpleNe...  Free
39  08-01-2014  Computer Science, MIS and Networking-simpleNea...  Free
40  19-12-2016                             Guide to Complete Yoga  Free

# Filtering Data

In [ ]:
# Review the columsn contained the the Microsoft Store Dataset
df_ms.columns

In [ ]:
df_ms.dtypes

In [ ]:
# numpy where method can also be used, but it returns the entire dataset
df_ms.where(df_ms['Rating']<3).dropna()

In [ ]:
high_num_ratings = (df_ms['# of Ratings'] > 999)

# To include multiple columns in the result, use a list.
many_ratings = df_ms.loc[high_num_ratings,['Name', '# of Ratings','Category']]
many_ratings

In [ ]:
# Exclude the 'Books' category using the tilde character
high_num_ratings = (df_ms['No of people Rated'] > 997) & ~(df_ms['Category'] =='Books')

# To include multiple columns in the result, use a list.
df_ms.loc[high_num_ratings,['Name', 'No of people Rated','Category','Price']]

In [ ]:
# Only include certain categories. Use isin() instead of multiple OR statements
include_categories = ['Books', 'Lifestyle', 'Social', 'Music']
high_num_ratings = (df_ms['No of people Rated'] > 997) & (df_ms['Category'].isin(include_categories))
                                                          
# To include multiple columns in the result, use a list.
df_ms.loc[high_num_ratings,['Name', 'No of people Rated','Category']]

In [ ]:
# Find the Top 20 items by # of people rated
df_ms.nlargest(20, ['No of people Rated'])

In [ ]:
# Search for partial string within a column
#   To avoid None (NaN) errors, set na=False
string_filter = df_ms['Name'].str.contains('Psyc'.title(),na=False)
df_ms.loc[string_filter, "Name"]

In [ ]:
df_ms.describe()

In [ ]:
df_ms['Name'].unique()

In [ ]:
# What's happening? The filter results in a True/False 'mask' applied to the data
#   Since only 5 of more than 5,000 app names contain the string 'Pysc' all visible mask items are False
print(string_filter)

In [47]:
my_subset = df_ms.copy()
my_condition = (my_subset['Category']=='Books') & (my_subset['Quarter']=='2018Q3')
my_subset = my_subset[my_condition]
my_subset

KeyError: 'Quarter'

## Using the `dt` class
The `dt` class on the Series object provides useful date and time features.

In [49]:
df_ms.columns

Index(['Name', 'Rating', 'No of people Rated', 'Category', 'Date', 'Price'], dtype='object')

In [76]:
# Create a DayOfWeek column and store the named day
df_ms['DayOfWeek'] = df_ms['Date'].dt.day_name()
df_ms.head()

AttributeError: Can only use .dt accessor with datetimelike values

In [ ]:
# Get earliest date
print('Earlist date: ;', df_ms['Date'].min())

# Get latest date
print('Latest date: ', df_ms['Date'].max())

# Get number of days between earliest and latest date
print(df_ms['Date'].max() - df_ms['Date'].min())

In [ ]:
# Filter Microsoft Store records by date
# Show only records after 2018
date_filter = (df_ms['Date'] >= '2018')
df_ms.loc[date_filter]

In [ ]:
# Filter Microsoft Store records by date
# Show only records in 2018
date_filter = (df_ms['Date'] >= '2018') & (df_ms['Date'] < '2019')
df_ms.loc[date_filter]

In [ ]:
# Filter Microsoft Store records by date
# Show only records in December of 2018
date_filter = (df_ms['Date'] >= pd.to_datetime('2018-12-01')) & (df_ms['Date'] <= pd.to_datetime('2018-12-31'))
df_dec_2018 = df_ms.loc[date_filter]
df_dec_2018

In [ ]:
# Get average item rating for December
print("Average item rating in Dec 2018: ", df_dec_2018['Rating'].mean())

In [ ]:
# Add a Quarter column and a week column using dt.to_period
df_ms['Quarter'] = df_ms['Date'].dt.to_period('Q')
df_ms['WeekOfYear'] = df_ms['Date'].dt.to_period('W')
df_ms

# See https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#dateoffset-objects for more objects

# Grouping and Aggregating Data

In this section, we will look at how to use the `groupby` Pandas method to aggregate data that resides in a Pandas DataFrame object. Essentiall, the `groupby` method allows us to define a subset of the columns in a DataFrame to aggregate on. We can then use defined and user-specifed functions to compute aggregate statistics for the aggregated data. The following table, modified from that found at https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html, describes some of the defined aggregations.

<table>
<thead><tr>
<th>Aggregation</th>
<th>Description</th>
</tr>
</thead>
<tbody>
<tr>
<td><code>count()</code></td>
<td>Total number of items</td>
</tr>
<tr>
<td><code>first()</code>, <code>last()</code></td>
<td>First and last item</td>
</tr>
<tr>
<td><code>mean()</code>, <code>median()</code></td>
<td>Mean and median</td>
</tr>
<tr>
<td><code>min()</code>, <code>max()</code></td>
<td>Minimum and maximum</td>
</tr>
<tr>
<td><code>std()</code>, <code>var()</code></td>
<td>Standard deviation and variance</td>
</tr>
<tr>
<td><code>mad()</code></td>
<td>Mean absolute deviation</td>
</tr>
<tr>
<td><code>prod()</code></td>
<td>Product of all items</td>
</tr>
<tr>
<td><code>sum()</code></td>
<td>Sum of all items</td>
</tr>
<tr>
<td><code>unique()</code></td>
<td>Unique values</td>
</tr>
<tr>
<td><code>nunique()</code></td>
<td>Number of unique values</td>
</tr>
</tbody>
</table>

The following code block demonstrates how to use the `groupby` method to compute the total sales for each of the stores included in the DataFrame.

In [ ]:
sales_data.groupby(['Store'])['Sales'].sum()

In [ ]:
# How would you group by product and display the total sales for each product?
sales_data.groupby(['Product'])['Sales'].sum()

The following code block provides a closer look at how the `groupby` method works. Specifically, if we convert the grouped object to a list, we see that we get a list of tuples. The first value in the tuple specifies the grouping, and the second item specifies the data that belongs to the associated group.

[Back to Table of Contents](#Table_of_Contents)<br>

In [ ]:
list(sales_data.groupby(['Store']))

If a single column is specified for grouping, any aggregations are returned as a `Series` object. Thus, we can access the values using the indexing and selection methods for `Series` objects. For example, the following code block shows how to get the total sales for store *E1*.

In [ ]:
sales_data.groupby(['Store'])['Sales'].sum()['E1']

If more than one column is specified for grouping, aggregated data is again returned as a `Series` object. However, this object will utilize a *multi-level* index as shown below.

In [ ]:
sales_data.groupby(['Store','Year'])['Sales'].sum()

To access the total sales for store *E1* during 2007, we first need to get the data for store *E1*, as shown below.

In [ ]:
sales_data.groupby(['Store','Year'])['Sales'].sum()['E1']

Then, we can index into the resulting `Series` to get the 2007 sales.

In [ ]:
sales_data.groupby(['Store','Year'])['Sales'].sum()['E1']['12/31/2007']

Essentially, when multiple columns are grouped on, the resulting aggregations can be accessed in a manner that is similar to a multi-level dictionary. If we would like the object returned to resemble a DataFrame instead, we can set the optional `as_index` argument to `False`. This is demonstrated below.

In [ ]:
sales_data.groupby(['Store','Year'], as_index = False)['Sales'].sum()

In addition to grouping on several columns, we can also perform several aggregations using the `agg` method. The following code block shows an example where we group the `sales_data` object by *Store* and *Year*, and then determine the *mean*, *total*, and *maximum* sales for each grouping.

In [ ]:
sales_data.groupby(['Store','Year'], as_index = False)['Sales'].agg({'mean','sum','max'})

As you can see in the previous code block, even though we specified `as_index = False`, the returned object still utilizes a multi-level index. However, by *chaining* the expression with the `reset_index()` method, we can obtain a standard DataFrame object as shown below.

In [ ]:
sales_data.groupby(['Store','Year'], as_index = False)['Sales'].agg({'mean','sum','max'}).reset_index()

We can also customize the column names as shown below.

In [ ]:
sales_data.groupby(['Store','Year'], as_index = False)['Sales'].agg({'Mean Sales':'mean',
                                                                     'Total Sales':'sum',
                                                                     'Maximum Sales':'max'}).reset_index()

Finally, in addition to using the defined aggregations, a user can specify custom aggregations using a *lambda function*. A *lambda function* is essentially a function without a defined name. To apply a lambda function, we use the syntax `lambda my_var: my_func(my_var)`, where `my_var` represents a variable that will be passed as an argument and `myfunc()` represents a function that receives `my_var` as an argument. In the case of our groupby object, the values belonging to each group will be passed as the variable.

The following code block shows how to use a lambda function to compute the $90^{th}$ percentile of the sales for each store, using NumPy's `percentile` method, along with the *mean*, *total*, and *maximum* sales for each store.

In [ ]:
sales_data.groupby(['Store','Year'], as_index = False)['Sales'].agg({'Mean Sales':'mean',
                                                                     'Total Sales':'sum',
                                                                     'Maximum Sales':'max',
                                                                     '90% Sales': lambda x: np.percentile(x, 90)}).reset_index()

It is also possible to perform different aggregations for different variables. However, it becomes quite complex to work with the returned objects. FOr more information, see https://pandas.pydata.org/pandas-docs/stable/groupby.html.

# Pivot Tables

The previous section showed how the `groupby` functionality available in Pandas allows you to aggregate data that resides in a `DataFrame` object in a very flexible manner. However, many users are very familiar with the aggregation capabilities made available by Microsoft Excel's pivot table functionality. Noting this, the Pandas package comes with a builtin `pivot_table` method that attempts to replicate this functionality in a simple fashion.

The following code block shows how to use this function to compute the `mean` sales for each store, by year.

In [ ]:
pd.pivot_table(sales_data, values = 'Sales', columns = 'Store', index = 'Year', aggfunc = 'mean')

The following code block shows how to use this function to compute the total sales for each store, by year.

In [ ]:
pd.pivot_table(sales_data, values = 'Sales', columns = 'Store', index = 'Year', aggfunc = 'sum')

In [ ]:
format_mapping = {"Sales": "${:,.2f}", "E2": "{:,.0f}", "W1": "{:.2f}%"}

sales_data.style.format(format_mapping)

In [ ]:
sales_data['Store'].unique()

# Combining Datasets

The final thing that we consider in this notebook is how to merge DataFrame objects. In particular, let's assume that we have another DataFrame object that includes information on each of the stores. The following code block creates such an object.

In [ ]:
stores_list = ['W1', 'E1', 'E2']

city_list = ['City A', 'City B', 'City C',]

state_list = ['State 1', 'State 2', 'State 2']

my_dict = {'Store': stores_list,
           'City': city_list,
           'State': state_list}

store_info = pd.DataFrame.from_dict(my_dict)

store_info

Let's assume that we want the total sales by state. To calculate this quantity, we first need to group the data in the `sales_data` object by store. This grouping is performed in the following code block, and the resulting object is stored in a new object called `grouped_data`.

In [ ]:
grouped_data = sales_data.groupby('Store', as_index = False)['Sales'].sum()
grouped_data

We can now use Pandas `merge` method to merge the `grouped_data` object with the `store_info` object. Since they both have a column that is named *Store*, the method will merge on this common column. This is shown below.

In [ ]:
grouped_data.merge(store_info)

We can now *chain* the `groupby` method to the end of the merged data to obtain the total sales by store as is shown in the following code block.

In [ ]:
grouped_data.merge(store_info).groupby('State', as_index = False)['Sales'].sum()

**Note that we could have performed the merging and aggregation in a single, *chained* statement as follows.**

In [ ]:
sales_data.groupby('Store', as_index = False)['Sales'].sum()\
.merge(store_info).groupby('State', as_index = False)['Sales'].sum()

Let's now consider the case where we don't have nformation for all of the stores. The following code block creates a new version of the `store_info` object where we only have information for stores *E1* and *W1*.

In [ ]:
stores_list = ['W1', 'E1', ]

city_list = ['City A', 'City B',]

state_list = ['State 1', 'State 2']

my_dict = {'Store': stores_list,
           'City': city_list,
           'State': state_list}

store_info2 = pd.DataFrame.from_dict(my_dict)

store_info2

The following code block shows the result of using the `merge` method to combine the `grouped_data` object with our new `store_info2` object. As you can see, with the default arguments, the returned object only includes records for stores included in both objects. Actually, the `method` is performing what is known as a *inner* where only records in both DataFrame objects are returned.

In [ ]:
grouped_data.merge(store_info2)

If we wanted the object returned to include records for all stores, even if one is missing in one of the DataFrames being joined, we can specify an *outer* join using the `how` argument. This is shown in the following code block. Since he `store_info2` object does not include any information for store *E2*, we will get a `NaN` value for the *City* and *State* columns of the associated row in the returned object.

In [ ]:
grouped_data.merge(store_info2, how = 'outer')

The Pandas package includes additional capabilities for joining DataFrame objects. For more info, see https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html.